# IsValidForGridAspectRatio Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
STLExportOptions..::..IsValidForGridAspectRatio Method
STLExportOptions Class See Also
---
Checks whether the value is allowed (is in the allowed range) for GridAspectRatio tessellation parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public static bool IsValidForGridAspectRatio(
	double value
)
```

Visual Basic
---
```text
Public Shared Function IsValidForGridAspectRatio ( _
	value As Double _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidForGridAspectRatio(
	double value
)
```

# ### Parameters
value
    Type: System..::..Double The value to be checked.
# ### Return Value
True if the value is valid for GridAspectRatio, false otherwise.
# See Also
STLExportOptions Class
Autodesk.Revit.DB Namespace